# -*- mode: ruby -*-

brew "mas"

# Command-line basics
brew "ripgrep"
brew "wget"
brew "watch"

# Everyday apps
cask "google-chrome"
cask "spotify"
cask "gitter"
cask "slack"
cask "discord"
cask "steam"

# Utils
cask "alfred"
cask "authy"
cask "dropbox"
cask "keepassx"
cask "keepingyouawake"
mas "Divvy", id: 413857545

# Dev tools
mas "Xcode", id: 497799835
brew "git"
brew "emacs"
cask "emacs"
brew "postgresql"
cask "postgres"
brew "cmake"
brew "hub"
brew "rbenv"
brew "ruby-build"
brew "terraform"
brew "rustup-init"
tap "heroku/brew"
brew "heroku"
cask "iterm2"
brew "direnv"

# Art
cask "paintbrush"
cask "magicavoxel"

# Fonts
tap "homebrew/cask-fonts"
cask "font-hack"
