brew "mas"

brew "ripgrep"
brew "wget"
brew "watch"

cask "google-chrome"
cask "spotify"
cask "slack"
cask "discord"
cask "steam"

cask "alfred"
cask "dropbox"
cask "keepingyouawake"
mas "Divvy", id: 413857545
cask "1password"
cask "setapp"
mas "Things 3", id: 904280696
brew "tailscale"
brew "magic-wormhole"
mas "Tailscale", id: 1475387142

mas "Xcode", id: 497799835
brew "git"
brew "terraform"
cask "iterm2"
brew "direnv"
cask "emacs"
brew "hub"
tap "heroku/brew"
brew "heroku/brew/heroku"
tap "CrunchyData/brew"
brew "CrunchyData/brew/cb"
cask "docker"
brew "libpq"
brew "postgresql@15", link: true
brew "asdf"
cask "github"

cask "homebrew/cask-fonts/font-hack"
